{
  "architectures": [
    "SiglipForImageClassification"
  ],
  "id2label": {
    "0": "call",
    "1": "dislike",
    "2": "fist",
    "3": "four",
    "4": "like",
    "5": "mute",
    "6": "no_gesture",
    "7": "ok",
    "8": "one",
    "9": "palm",
    "10": "peace",
    "11": "peace_inverted",
    "12": "rock",
    "13": "stop",
    "14": "stop_inverted",
    "15": "three",
    "16": "three2",
    "17": "two_up",
    "18": "two_up_inverted"
  },
  "initializer_factor": 1.0,
  "label2id": {
    "call": 0,
    "dislike": 1,
    "fist": 2,
    "four": 3,
    "like": 4,
    "mute": 5,
    "no_gesture": 6,
    "ok": 7,
    "one": 8,
    "palm": 9,
    "peace": 10,
    "peace_inverted": 11,
    "rock": 12,
    "stop": 13,
    "stop_inverted": 14,
    "three": 15,
    "three2": 16,
    "two_up": 17,
    "two_up_inverted": 18
  },
  "model_type": "siglip",
  "problem_type": "single_label_classification",
  "text_config": {
    "attention_dropout": 0.0,
    "hidden_act": "gelu_pytorch_tanh",
    "hidden_size": 768,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-06,
    "max_position_embeddings": 64,
    "model_type": "siglip_text_model",
    "num_attention_heads": 12,
    "num_hidden_layers": 12,
    "projection_size": 768,
    "torch_dtype": "float32",
    "vocab_size": 256000
  },
  "torch_dtype": "float32",
  "transformers_version": "4.50.3",
  "vision_config": {
    "attention_dropout": 0.0,
    "hidden_act": "gelu_pytorch_tanh",
    "hidden_size": 768,
    "image_size": 224,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-06,
    "model_type": "siglip_vision_model",
    "num_attention_heads": 12,
    "num_channels": 3,
    "num_hidden_layers": 12,
    "patch_size": 16,
    "torch_dtype": "float32"
  }
}
